//#include <stdio.h>
//
//int main() {
//    char c;
//    c = getchar(); // 输入一个字符给字符变量c
//
//    while (c != '\n') { // 检查c的值是否为换行符\n
//        if ((c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z')) { // c如果是字母
//            if ((c >= 'W' && c <= 'Z') || (c >= 'w' && c <= 'z')) {
//                c = c - 22; // 如果是26个字母中最后4个字母之一就使c-22
//            } else {
//                c = c + 4; // 如果是前面22个字母之一，就使c加4，即变成其后第4个字母
//            }
//        }
//        printf("%c", c); // 输出已改变的字符
//        c = getchar(); // 再输入下一个字符给字符变量c
//    }
//
//    printf("\n");
//    return 0;
//}
#include <stdio.h>

int main()
{
    char c;
    while ((c = getchar()) != '\n') // 输入一个字符给字符变量 c 并检查其值是否是换行符
    {
        if ((c >= 'A' && c <= 'Z') || (c >= 'a' && c <= 'z')) // c 如果是字母
        {
            c = c + 4; // 只要是字母，都先加 4
            if (c > 'Z' && c <= 'Z' + 4 || c > 'z') // 如果是 26 个字母中最后 4 个字母之一
                c = c - 26; // c 的值改变为 26 个字母中最前面的 4 个字母中对应的字母
        }
        printf("%c", c); // 输出已改变的字符
    }

    printf("\n");
    return 0;
}
